
&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокТоваров.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)  
	ТекущаяСтрока = Элементы.СписокТоваров.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
    КонецЕсли;
КонецПроцедуры
